cases/11x8e/RPM7000/kEpsilonUnsteady/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    innerCylinder
    {
        type            calculated;
        value           uniform 0;
    }
    innerCylinder_slave
    {
        type            calculated;
        value           uniform 0;
    }
    propellerTip
    {
        type            calculated;
        value           nonuniform List<scalar> 
9073
(
1.09345
2.66018
3.13769
2.84888
2.69262
3.87898
2.29983
2.52474
...
)
;
    }
    nonConformalCyclic_on_innerCylinder
    {
        type            nonConformalCyclic;
    }
    nonConformalCyclic_on_innerCylinder_slave
    {
        type            nonConformalCyclic;
    }
    nonConformalError_on_innerCylinder
    {
        type            nonConformalError;
    }
    nonConformalError_on_innerCylinder_slave
    {
        type            nonConformalError;
    }
}


// ************************************************************************* //
